app/controllers/admin/events_controller.rb

  def index
    @events = Event.all.paginate(:page=>params[:page],:per_page=>"30")
---
SELECT * FROM `events`