app/controllers/event_comments_controller.rb

SELECT * FROM `event_comments` WHERE (`event_comments`.`id` = 10)
---
  def show
    @event_comment = EventComment.find(params[:id])

INSERT INTO `event_comments` (`comment`, `created_at`, `event_id`, `updated_at`, `user_id`) VALUES('aasdfasdf', '2010-12-11 13:59:42', NULL, '2010-12-11 13:59:42', NULL)
---
  def create
    @event_comment = EventComment.new(params[:event_comment])

    @event_comment.user=current_user
    @event_comment.save