app/controllers/events_controller.rb

INSERT INTO `events` (`name`, `start_date`, `city`, `created_at`, `zip_code`, `series`, `featured`, `notes`, `updated_at`, `logo_path`, `lng`, `user_id`, `website`, `venue_location`, `measurement`, `promoter`, `end_date`, `event_type`, `lat`, `state`, `distance`) VALUES('12 Hours in the Wild West', '2011-12-15', 'Winter Park', '2011-12-11 01:15:01', NULL, '', 'n', '', '2011-12-11 01:15:01', NULL, -117.3708863, 20, 'http://epicsingletrack.com/', 'Winter Park Ski Resort', 'miles', 'Zia Rides', NULL, 'Short Track', 34.5279546, 'CA', '')
---
  def create
    @event = Event.new(params[:event])
    @event.user = current_user

    @event.save

SELECT * FROM `event_comments` WHERE (`event_comments`.event_id = 1)
SELECT * FROM `events` WHERE (`events`.`id` = 1)
INSERT INTO `event_comments` (`comment`, `created_at`, `event_id`, `updated_at`, `user_id`) VALUES('asdfasdfddd', '2010-12-13 03:12:48', 1, '2010-12-13 03:12:48', 1)
---
  def create_comment
    @event = Event.find(params[:event_comment][:event_id])

    if current_user_logged_in? and !params[:event_comment][:comment].blank?
      @event_comment = EventComment.new(params[:event_comment])
      @event_comment.user=current_user
      @event_comment.save

SELECT * FROM `events` WHERE (`events`.`id` = 0)
UPDATE `events` SET `updated_at` = '2010-11-26 05:53:05', `start_date` = '2011-08-07', `name` = 'Breck Epic2', `event_type` = 'Cross Country' WHERE `id` = 6
---
  def update
    @event = Event.find(params[:id])

    #@event.event_comments.build(:user_id=>current_user_id})

    respond_to do |format|
      if @event.update_attributes(params[:event])

SELECT * FROM `events` WHERE (`events`.`id` = 9)
DELETE FROM `events` WHERE `id` = 9
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy