app/controllers/home_controller.rb

  def index
    @events = Event.paginate(:all,:conditions=>["start_date > ?",Time.now ],
      :order=>"start_date,name",:page=>params[:page],:per_page=>"30")
---
SELECT * FROM `events` WHERE (start_date > '2010-11-23 21:23:26') ORDER BY start_date,name LIMIT 0, 30

  def my_page
    @events = Event.paginate_by_user_id(current_user.id,
      :order=>"start_date, name, state",:page=>params[:page],:per_page=>"30")#.paginate(:page=>params[:page],:per_page=>"30")
    @user = User.find(current_user_id)
---
SELECT * FROM `events` WHERE (`events`.`user_id` = 20) AND (start_date >= '2011-12-10 19:56:29') ORDER BY start_date, name, state LIMIT 0, 30
SELECT * FROM `users` WHERE (`users`.`id` = 20)