app/controllers/home_controller.rb

SELECT * FROM `events` WHERE (`events`.`user_id` = 1) ORDER BY start_date, name, state LIMIT 0, 30
---
  def my_races
    @events = Event.paginate_by_user_id(current_user.id,
      :order=>"start_date, name, state",:page=>params[:page],:per_page=>"30")#.paginate(:page=>params[:page],:per_page=>"30")