app/controllers/ratings_controller.rb

SELECT * FROM `ratings` WHERE (`ratings`.`user_id` IS NULL AND `ratings`.`object` = 'Event' AND `ratings`.`object_id` = '14') LIMIT 1
UPDATE `ratings` SET `updated_at` = '2011-12-09 13:35:53', `rating` = 3 WHERE `id` = 5
INSERT INTO `ratings` (`rating`, `created_at`, `updated_at`, `user_id`, `object_id`, `object`) VALUES(3, '2011-12-11 01:16:02', '2011-12-11 01:16:02', 20, '17', 'Event')
---
  def rate

    if current_user_logged_in?
      user_rating = Rating.find_by_user_id_and_object_id_and_object(current_user_id, params[:id], 'Event')

      if user_rating and user_rating.rating!= params[:score]
        user_rating.rating=params[:score]
        user_rating.save
      else
        Rating.create({:rating=>params[:score],
            :user_id=>current_user_id,
            :object_id=>params[:id],
            :object=>'Event'
          } )