app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def edit
    begin
      @user = User.find(params[:id],:conditions=>["id=?",current_user_id])

INSERT INTO `users` (`salt`, `city`, `club`, `created_at`, `country`, `zipcode`, `updated_at`, `nickname`, `emergency_contact_phone`, `license`, `hashed_password`, `role`, `activation_code`, `lng`, `birth_date`, `address_1`, `last_name`, `address_2`, `phone`, `opt_in`, `lat`, `emergency_contact`, `reset_code`, `email`, `first_name`, `state`) VALUES('21759583400.0426710359363212', 'black hawk', NULL, '2011-05-14 22:30:36', 'USA', '80422', '2011-05-14 22:30:36', 'cwilhelm2', NULL, NULL, '22248982ee630e5a3032f3f1587a04e2367ca718', 'user', NULL, NULL, NULL, NULL, 'wilhelm', NULL, NULL, 'y', NULL, NULL, NULL, 'cwfoxrider2-1@yahoo.com', 'curt', 'CA')
---
  def create
    @user = User.new(params[:user])
    @user.create_activation_code

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def update
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`email` = 'curt_wilhelm@yahoo.com') LIMIT 1
---
  def forgot
    if request.post?
      user = User.find_by_email(params[:user][:email])

SELECT * FROM `users` WHERE (`users`.`reset_code` = 'c4b23eda9e99d588e34e7f50441ef66c649714ea') LIMIT 1
UPDATE `users` SET `updated_at` = '2011-05-14 22:26:55', `salt` = '21750940200.0265670413633308', `hashed_password` = 'c02fad1ec75c0d9041e8c8ce06c1707ba53edc71' WHERE `id` = 1
---
  def reset
    @user = User.find_by_reset_code(params[:reset_code]) unless params[:reset_code].nil?
    @user.reset_password=true
    if request.post?

      if @user.update_attributes(:password => params[:user][:password], :password_confirmation => params[:user][:password_confirmation])

SELECT * FROM `users` WHERE (`users`.`activation_code` = '53f0bf27239f417bd737d3c6019e021ba381=0f0b') LIMIT 1
---
  def activate
    @user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].nil?

INSERT INTO `users` (`salt`, `city`, `club`, `facebook_id`, `created_at`, `country`, `zipcode`, `updated_at`, `nickname`, `emergency_contact_phone`, `license`, `hashed_password`, `role`, `activation_code`, `lng`, `birth_date`, `address_1`, `last_name`, `address_2`, `phone`, `facebook_session_key`, `opt_in`, `lat`, `emergency_contact`, `reset_code`, `email`, `first_name`, `state`) VALUES(NULL, NULL, NULL, '1402669323', '2011-12-11 00:50:52', 'USA', NULL, '2011-12-11 00:50:52', NULL, NULL, NULL, NULL, 'user', NULL, NULL, NULL, NULL, 'Wilhelm', NULL, NULL, NULL, 'y', NULL, NULL, NULL, 'curt_wilhelm@yahoo.com', 'curt_wilhelm@yahoo.com', NULL)
---
  def link_user_accounts
    if current_user.nil?
      #register with fb
      User.create_from_fb_connect(current_facebook_user)